{
  "topics": {
    "Unspecified": "Unspecified",
    "ManageNeuron": "Neuron Management",
    "ExchangeRate": "Exchange Rate",
    "NetworkEconomics": "Network Economics",
    "Governance": "Governance",
    "NodeAdmin": "Node Admin",
    "ParticipantManagement": "Participant Management",
    "SubnetManagement": "Subnet Management",
    "NetworkCanisterManagement": "System Canister Management",
    "Kyc": "KYC",
    "NodeProviderRewards": "Node Provider Rewards",
    "SnsDecentralizationSale": "SNS Decentralization Sale"
  },
  "topics_description": {
    "Unspecified": "",
    "ManageNeuron": "A special topic by means of which a neuron can be managed by the followees for this topic (in this case, there is no fallback to default). Votes on this topic are not included in the voting history of the neuron. For proposals on this topic, only the neuron’s followees on the topic that the proposals pertain to are allowed to vote. Because the set of eligible voters of proposals on this topic is restricted, proposals on this topic have a shorter than normal voting period.",
    "ExchangeRate": "All proposals provide information in “real time” about the market value of ICP, as measured by an International Monetary Fund (IMF) Special Drawing Right (SDR) , which allows the NNS to convert ICP to cycles (which power computation) at a rate that keeps their real-world cost constant. Because proposals on this topic are very frequent, they have a shorter voting period, and votes on this topic are not included in the voting history of the neuron.",
    "NetworkEconomics": "Proposals that administer network economics — for example, determining what rewards should be paid to node providers.",
    "Governance": "All proposals that administer governance — for example, motions and the configuration of certain parameters.",
    "NodeAdmin": "All proposals that administer node machines somehow, including but not limited to upgrading or configuring the OS, upgrading or configuring the virtual machine framework, and upgrading or configuring the node replica software.",
    "ParticipantManagement": "All proposals that administer network participants — for example, granting and revoking DCIDs (data center identities) or NOIDs (node operator identities).",
    "SubnetManagement": "All proposals that administer network subnets — for example, creating new subnets, adding and removing subnet nodes, and splitting subnets",
    "NetworkCanisterManagement": "Installing and upgrading “system” Canisters that belong to the network — for example, upgrading the NNS.",
    "Kyc": "Proposals that update KYC information for regulatory purposes — for example, during the initial Genesis distribution of ICP in the form of neurons.",
    "NodeProviderRewards": "Topic for proposals to reward node providers.",
    "SnsDecentralizationSale": "SNS Decentralization Sale"
  },
  "rewards": {
    "PROPOSAL_REWARD_STATUS_UNKNOWN": "Unknown",
    "PROPOSAL_REWARD_STATUS_ACCEPT_VOTES": "Accepting Votes",
    "PROPOSAL_REWARD_STATUS_READY_TO_SETTLE": "Ready to Settle",
    "PROPOSAL_REWARD_STATUS_SETTLED": "Settled",
    "PROPOSAL_REWARD_STATUS_INELIGIBLE": "Ineligible"
  },
  "rewards_description": {
    "PROPOSAL_REWARD_STATUS_UNKNOWN": "",
    "PROPOSAL_REWARD_STATUS_ACCEPT_VOTES": "The proposal is still accepting votes, for the purpose of voting rewards.",
    "PROPOSAL_REWARD_STATUS_READY_TO_SETTLE": "The proposal is no longer accepting votes. It is due to settle in the next reward event.",
    "PROPOSAL_REWARD_STATUS_SETTLED": "The proposal has been taken into account in a reward event.",
    "PROPOSAL_REWARD_STATUS_INELIGIBLE": "The proposal is not eligible to be taken into account in a reward event."
  },
  "status": {
    "PROPOSAL_STATUS_UNKNOWN": "Unknown",
    "PROPOSAL_STATUS_OPEN": "Open",
    "PROPOSAL_STATUS_REJECTED": "Rejected",
    "PROPOSAL_STATUS_ACCEPTED": "Adopted",
    "PROPOSAL_STATUS_EXECUTED": "Executed",
    "PROPOSAL_STATUS_FAILED": "Failed"
  },
  "status_description": {
    "PROPOSAL_STATUS_UNKNOWN": "",
    "PROPOSAL_STATUS_OPEN": "A decision has not yet been made to adopt or reject the proposal.",
    "PROPOSAL_STATUS_REJECTED": "The proposal has been rejected.",
    "PROPOSAL_STATUS_ACCEPTED": "The proposal has been adopted. Either execution has not yet started, or it has started but the outcome is not yet known.",
    "PROPOSAL_STATUS_EXECUTED": "The proposal was adopted and successfully executed.",
    "PROPOSAL_STATUS_FAILED": "The proposal was adopted, but execution failed."
  },
  "actions": {
    "RegisterKnownNeuron": "Register Known Neuron",
    "ManageNeuron": "Manage Neuron",
    "ApproveGenesisKyc": "Approve Genesis KYC",
    "ManageNetworkEconomics": "Manage Network Economics",
    "RewardNodeProvider": "Reward Node Provider",
    "RewardNodeProviders": "Reward Node Providers",
    "AddOrRemoveNodeProvider": "Add or Remove Node Provider",
    "SetDefaultFollowees": "Set Default Followees",
    "Motion": "Motion",
    "SetSnsTokenSwapOpenTimeWindow": "Start decentralization sale"
  },
  "actions_description": {
    "RegisterKnownNeuron": "This proposal registers an existing neuron as a “known neuron,” giving it a name and an optional description, and adding the neuron to the list of known neurons.",
    "ManageNeuron": "This type of proposal calls a major function on a specified target neuron. Only the followees of the target neuron may vote on these proposals, which effectively provides the followees with control over the target neuron. This can provide a convenient and \nhighly secure means for a team of individuals to manage an important neuron. For example, a neuron might hold a large balance, or belong to an organization of high repute, and be publicized so that many other neurons can follow its vote. In both cases, managing the private key of the principal securely could be problematic. (Either a single copy is held, which is very insecure and provides for a single party to take control, or a group of individuals must divide responsibility — for example, using threshold cryptography, which is complex and time consuming). To address this using this proposal type, the important neuron can be configured to follow the neurons controlled by individual members of a team. Now they can submit proposals to make the important neuron perform actions, which are adopted if and only if a majority of them vote to adopt. (Submitting such a proposal costs a small fee, to prevent denial-of-service attacks.) Nearly any command on the target neuron can be executed, including commands that change the follow rules, allowing the set of team members to be dynamic. Only the final step of dissolving the neuron once its dissolve delay reaches zero cannot be performed using this type of proposal, since this would allow control/“ownership” over the locked balances to be transferred. (The only exception to this rule applies to not-for-profit organizations, which may be allowed to dissolve their neurons without using the initial private key.) To prevent a neuron falling under the malign control of the principal’s private key by accident, the private key can be destroyed so that the neuron can only be controlled by its followees, although this makes it impossible to subsequently unlock the balance.",
    "ApproveGenesisKyc": "When new neurons are created at Genesis, they have GenesisKYC=false. This restricts what actions they can perform. Specifically, they cannot spawn new neurons, and once their dissolve delays are zero, they cannot be disbursed and their balances unlocked to new accounts. This proposal sets GenesisKYC=true for batches of principals.<br/>(<i>Special note:</i> The Genesis event disburses all ICP in the form of neurons, whose principals must be KYCed. Consequently, all neurons created after Genesis have GenesisKYC=true set automatically since they must have been derived from balances that have already been KYCed.)",
    "ManageNetworkEconomics": "This is a single proposal type which can update one or several economic parameters:<br/>• <b>Reject cost: </b>The amount of ICP the proposer of a rejected proposal will be charged — to prevent the spamming of frivolous proposals.<br/><b>Minimum Neuron Stake: </b>Set the minimum number of ICP required for creation of a neuron. The same limit must also be respected when increasing dissolve delay or changing the neuron state from dissolving to aging.<br/>• <b>Neuron Management fee: </b>The cost in ICP per neuron management proposal. Here the NNS is doing work on behalf of a specific neuron, and a small fee will be applied to prevent overuse of this feature (i.e., spam).<br/>• <b>Minimum ICP/SDR rate: </b>To prevent mistakes, there is a lower bound for the ICP/SDR rate, managed by network economic proposals.<br/>• <b>Dissolve delay of spawned neurons: </b>The dissolve delay of a neuron spawned from the maturity of an existing neuron.<br/>• <b>Maximum node provider rewards: </b>The maximum rewards to be distributed to node providers in a single distribution event (proposal).<br/>• <b>Transaction fee: </b>The transaction fee that must be paid for each ledger transaction.<br/>• <b>Maximum number of proposals to keep per topic: </b>The maximum number of proposals to keep, per topic. When the total number of proposals for a given topic is greater than this number, the oldest proposals that have reached a “final” state may be deleted to save space.",
    "RewardNodeProvider": "A proposal to reward a node provider an amount of ICP as compensation for providing nodes to the IC.",
    "RewardNodeProviders": "A proposal to reward multiple node providers an amount of ICP as compensation for providing nodes to the IC.",
    "AddOrRemoveNodeProvider": "Assign (or revoke) an identity to a node provider, associating key information regarding the legal person associated that should provide a way to uniquely identify it.",
    "SetDefaultFollowees": "Specify the list of followees that a freshly created neuron should have.",
    "Motion": "A motion is a text that can be adopted or rejected. No code is executed when a motion is adopted. An adopted motion should guide the future strategy of the Internet Computer ecosystem.",
    "SetSnsTokenSwapOpenTimeWindow": "Start decentralization sale"
  },
  "execute_nns_functions": {
    "0": "Unspecified",
    "1": "Create Subnet",
    "2": "Add Node to Subnet",
    "3": "NNS Canister Install",
    "4": "NNS Canister Upgrade",
    "5": "Bless Replica Version",
    "6": "Recover Subnet",
    "7": "Update Subnet Config",
    "8": "Assign Node Operator ID (NOID)",
    "9": "NNS Root Canister Upgrade",
    "10": "ICP/XDR Conversion Rate",
    "11": "Update Subnet Replica Version",
    "12": "Clear Provisional Whitelist",
    "13": "Remove Node from Subnet",
    "14": "Set Authorized Subnets",
    "15": "Set Firewall Config",
    "16": "Update Node Operator Config",
    "17": "Stop or Start NNS Canister",
    "18": "Remove Nodes from Registry",
    "19": "Uninstall Code",
    "20": "Update Node Rewards Table",
    "21": "Add or Remove Data Centers",
    "22": "Update Unassigned Nodes Config",
    "23": "Remove Node Operators",
    "24": "Reroute Canister Ranges",
    "25": "Add Firewall Rules",
    "26": "Remove Firewall Rules",
    "27": "Update Firewall Rules",
    "28": "Prepare Canister Migration",
    "29": "Complete Canister Migration",
    "30": "Bless new SNS deployment"
  },
  "execute_nns_functions_description": {
    "0": "",
    "1": "Combine a specified set of nodes, typically drawn from data centers and operators in such a way as to guarantee their independence, into a new decentralized subnet. The execution of this external update first initiates a new instance of the distributed key generation protocol. The transcript of that protocol is written to a new subnet record in the registry, together with initial configuration information for the subnet, from where the nodes comprising the subnet pick it up.",
    "2": "Add a new node to a subnet. The node cannot be currently assigned to a subnet. The execution of this proposal changes an existing subnet record to add a node. From the perspective of the NNS, this update is a simple update of the subnet record in the registry.",
    "3": "A proposal to add a new canister to be installed and executed in the NNS subnetwork. The root canister, which controls all Canisters on the NNS except for itself, handles this proposal type. The call also expects the Wasm module that shall be installed.",
    "4": "A proposal to upgrade an existing canister in the NNS subnetwork. This proposal type is executed by the root canister. Beyond upgrading the Wasm module of the target canister, the proposal can also set the authorization information and the allocations.",
    "5": "A proposal to bless a new version to which the replicas can be upgraded. The proposal registers a replica version (identified by the hash of the installation image) in the registry. Besides creating a record for that version, the proposal also appends that version to the list of “blessed versions” that can be installed on a subnet. By itself, this proposal does not effect any upgrade. (In the future, there will only be one blessed version of the replica software at any given time.)",
    "6": "Update a subnet’s recovery CUP (used to recover subnets that have stalled). Nodes that find a recovery CUP for their subnet will load that CUP from the registry and restart the replica from that CUP.",
    "7": "Update a subnet’s configuration. This proposal updates the subnet record in the registry, with the changes being picked up by the nodes on the subnet when they reference the respective registry version. Subnet configuration comprises protocol parameters that must be consistent across the subnet (e.g., message sizes).",
    "8": "Assign an identity to a node operator associating key information regarding its ownership, the jurisdiction in which it is located, and other information. The node operator is stored as a record in the registry. It contains the remaining node allowance for that node operator, that is the number of nodes the node operator can still add to the IC. When an additional node is added by the node operator, the remaining allowance is decreased.",
    "9": "A proposal to upgrade the root canister in the NNS subnetwork. The proposal is processed by the Lifeline canister, which controls the root canister. The proposal updates the Wasm module as well as the authorization settings.",
    "10": "Instruct the NNS about the market value of 1 ICP as measured by an IMF SDR. This setting affects cycles pricing (as the value of cycles shall be constant with respect to IMF SDRs).",
    "11": "Update the replica version running on a given subnet. The proposal changes the replica version that is used on the specified subnet. The version must be contained in the list of blessed replica versions. The upgrade is performed when the subnet creates the next regular CUP.",
    "12": "Clears the provisional whitelist, which allows the listed principals to create Canisters with cycles. The mechanism is only needed for bootstrap and testing and must be deactivated afterward.",
    "13": "Remove a node from a subnet. It then becomes available for reassignment. The execution of this proposal changes an existing subnet record to remove a node. From the perspective of the NNS, this update is a simple update of the subnet record in the registry.",
    "14": "Informs the cycles minting canister that a certain principal is authorized to use certain subnetworks (from a list). Can also be used to set the “default” list of subnetworks that principals without special authorization are allowed to use.",
    "15": "Change the Firewall configuration in the registry (configures which boundary nodes subnet blockchain replicas will communicate with).",
    "16": "Change a Node Operator’s allowance in the registry.",
    "17": "Stop or start an NNS canister.",
    "18": "Remove unassigned nodes from the registry.",
    "19": "Uninstall code of a canister.",
    "20": "Update the node rewards table.",
    "21": "Add or remove Data Center records.",
    "22": "Update the configuration for all unassigned nodes.",
    "23": "Remove node operator records from the registry.",
    "24": "In the routing table in the registry, remap canister ID ranges from one subnet to a different subnet.<br/><br/>The steps of canister migration are:<ol><li>Prepare Canister Migration</li><li>Reroute Canister Ranges</li><li>Complete Canister Migration</li></ol>",
    "25": "Add firewall rules in the registry. Nodes use a firewall to protect themselves from network attacks.",
    "26": "Remove firewall rules in the registry. Nodes use a firewall to protect themselves from network attacks.",
    "27": "Update firewall rules in the registry. Nodes use a firewall to protect themselves from network attacks.",
    "28": "Insert or update canister migrations entries. Such entries specify that a migration of canister ID ranges is currently ongoing.<br/><br/>The steps of canister migration are:<ol><li>Prepare Canister Migration</li><li>Reroute Canister Ranges</li><li>Complete Canister Migration</li></ol>",
    "29": "Remove canister migrations entries. Such entries specify that a migration of canister ID ranges is currently ongoing.<br/><br/>The steps of canister migration are:<ol><li>Prepare Canister Migration</li><li>Reroute Canister Ranges</li><li>Complete Canister Migration</li></ol>",
    "30": "Bless new SNS deployment"
  }
}
